; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v4)
		(pred_3 ?v2)
		(pred_1 ?v7)
		(pred_4 ?v7)
		(pred_2 ?v2 ?v7)
		(pred_6)
		(pred_5 ?v2))

   (:action op_2
       :parameters  (?v8 ?v5)
       :precondition (and (not-eq ?v8 ?v5) 
                          (pred_1 ?v8) (pred_1 ?v5) (pred_4 ?v8))
       :effect (and  (pred_4 ?v5)
		     (not (pred_4 ?v8))))


   (:action op_3
       :parameters (?v1 ?v6)
       :precondition  (and  (pred_3 ?v1) (pred_1 ?v6)
			    (pred_2 ?v1 ?v6) (pred_4 ?v6) (pred_6))
       :effect (and (pred_5 ?v1)
		    (not (pred_2 ?v1 ?v6)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v1  ?v6)
       :precondition  (and  (pred_3 ?v1) (pred_1 ?v6)
			    (pred_5 ?v1) (pred_4 ?v6))
       :effect (and (pred_2 ?v1 ?v6)
		    (pred_6)
		    (not (pred_5 ?v1)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_04 obj_06 obj_02 obj_01 obj_05 
          obj_03 obj_07 
)
(:init
(pred_1 obj_04)
(pred_1 obj_06)
(pred_1 obj_02)
(pred_1 obj_01)
(pred_1 obj_05)
(pred_3 obj_03)
(pred_3 obj_07)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_6)
(pred_2 obj_03 obj_06)
(pred_2 obj_07 obj_02)
(pred_4 obj_01)
)
(:goal
(and
(pred_2 obj_03 obj_05)
(pred_2 obj_07 obj_02)
)
)

(:constraints
  (sometime-before  (pred_2 obj_03 obj_05) (pred_4 obj_04))
)
)

; plan
1. (op_2 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_06)
   goals met: 1 of 2
2. (op_3 obj_03 obj_06)
   deleted: (pred_2 obj_03 obj_06) (pred_6)
   added: (pred_5 obj_03)
   goals met: 1 of 2
3. (op_2 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 1 of 2
4. (op_1 obj_03 obj_02)
   deleted: (pred_5 obj_03)
   added: (pred_2 obj_03 obj_02) (pred_6)
   goals met: 1 of 2
5. (op_3 obj_07 obj_02)
   deleted: (pred_2 obj_07 obj_02) (pred_6)
   added: (pred_5 obj_07)
   goals met: 0 of 2
6. (op_2 obj_02 obj_04)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_04)
   goals met: 0 of 2
7. (op_1 obj_07 obj_04)
   deleted: (pred_5 obj_07)
   added: (pred_2 obj_07 obj_04) (pred_6)
   goals met: 0 of 2
8. (op_2 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 0 of 2
9. (op_3 obj_03 obj_02)
   deleted: (pred_2 obj_03 obj_02) (pred_6)
   added: (pred_5 obj_03)
   goals met: 0 of 2
10. (op_2 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_05)
   goals met: 0 of 2
11. (op_1 obj_03 obj_05)
   deleted: (pred_5 obj_03)
   added: (pred_2 obj_03 obj_05) (pred_6)
   goals met: 1 of 2
12. (op_2 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_04)
   goals met: 1 of 2
13. (op_3 obj_07 obj_04)
   deleted: (pred_2 obj_07 obj_04) (pred_6)
   added: (pred_5 obj_07)
   goals met: 1 of 2
14. (op_2 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_02)
   goals met: 1 of 2
15. (op_1 obj_07 obj_02)
   deleted: (pred_5 obj_07)
   added: (pred_2 obj_07 obj_02) (pred_6)
   goals met: 2 of 2
